# 1) Картеж
#     -Неизменяемые
#     (менее ресурсозатратные, чем списки; безопасность)
#     -Упорядоченные
#     -Элементы - любые типы данных
# 2) Списки:
#     -Изменяемые
#     -Упорядоченные
#     -Элементы - любые типы данных
# 3) Множества: - my_list = list(set(my_list))
#     -Изменяемые
#     -Все элементы уникальные
#     -Неупорядоченные
#     -Элементы - неизменяемые типы данных
#  Замороженое множество - Неизменяемое
# 4) Словари:
#     -Изменяемые
#     -Неупорядоченные
#     -Ключи- неизменяемые типы данных
#     -Значения - любые типы данных
my_list = [1,2,3,2,1,5,4]
my_list = list(set(my_list))
print(m)